INSERT INTO authors
    (firstname, lastname, patronymic)
VALUES
    ('Антон','Романов','Андреевич'),
    ('Артем','Ломанов','Андреевич'),
    ('Кирилл','Калынков','Георгиевич'),
    ('Андрей','Суднев','Игоревич'),
    ('Тимур','Ламинатов','Евгеньевич'),
    ('Арина','Маразова','Алексеевна'),
    ('Петр','Артемьев','Антонович'),
    ('Ирина','Евшова','Максимовна');

INSERT INTO genres
    (name)
VALUES
    ('Драма'),('Триллер'),('Документальный'),('Антиутопия'),
    ('Фэнтази'),('Детективы'),('Научный'),('Биография');

INSERT INTO books
    (name, author_id, genre_id, publisher, year, city)
VALUES
    ('1984', 0, 3, 'Москва', '1586', 'Самара'),
    ('Алхимик', 1, 0, 'Санкт-Петербург','1846', 'Саратов'),
    ('Исчезнувшая', 2, 1, 'O''Reilly', '1955', 'Казань'),
    ('Чернобыль', 3, 2, 'Москва','1930', 'Ульяновск'),
    ('Властелин колец', 4, 4, 'Санкт-Петербург', '1509', 'Пенза'),
    ('Шерлок Холмс', 5, 5, 'O''Reilly','1965', 'Уфа'),
    ('Марсианин', 6, 6, 'Санкт-Петербург', '1977', 'Оренбург'),
    ('Арсен Венгер', 7, 7, 'Москва','1886', 'Саранск'),
    ('О дивный новый мир', 2, 3, 'O''Reilly','1677', 'Псков'),
    ('Портрет Дориана Грея', 4, 0, 'Москва','1775', 'Нижний Новгород'),
    ('Гордость и предубеждение', 2, 0, 'Москва','1678', 'Новосибирск'),
    ('Бойцовский клуб', 7, 1, 'Санкт-Петербург','1672', 'Волгоград'),
    ('Процесс', 7, 1, 'O''Reilly','1996', 'Краснодар'),
    ('Война и мир', 0, 7, 'Санкт-Петербург','1994', 'Ростов-на-Дону'),
    ('Пикник на обочине', 4, 4, 'Москва','1894', 'Сочи'),
    ('Преступление и наказание', 0, 6, 'Москва','1860', 'Севастополь'),
    ('Алекс Фергюсон', 7, 7, 'O''Reilly','1588', 'Великий Новгород'),
    ('Три товарища', 1, 0, 'O''Reilly','1999', 'Екатеринбург'),
    ('Заводной апельсин', 6, 5, 'Москва','1645', 'Челябинск'),
    ('Мартин Иден', 2, 1, 'Санкт-Петербург','1785', 'Пермь');




